{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFD"
      },
      {
        "type": "Lowercase"
      },
      {
        "type": "StripAccents"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "BertPreTokenizer"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          2
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          3
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": {
    "type": "WordPiece",
    "prefix": "##",
    "cleanup": true
  },
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[UNK]": 0,
      "[PAD]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      "(": 5,
      ")": 6,
      ",": 7,
      "-": 8,
      ".": 9,
      "/": 10,
      "?": 11,
      "a": 12,
      "b": 13,
      "c": 14,
      "d": 15,
      "e": 16,
      "f": 17,
      "g": 18,
      "h": 19,
      "i": 20,
      "j": 21,
      "k": 22,
      "l": 23,
      "m": 24,
      "n": 25,
      "o": 26,
      "p": 27,
      "r": 28,
      "s": 29,
      "t": 30,
      "u": 31,
      "v": 32,
      "w": 33,
      "y": 34,
      "z": 35,
      "##e": 36,
      "##m": 37,
      "##p": 38,
      "##u": 39,
      "##n": 40,
      "##y": 41,
      "##a": 42,
      "##i": 43,
      "##l": 44,
      "##t": 45,
      "##r": 46,
      "##f": 47,
      "##k": 48,
      "##o": 49,
      "##j": 50,
      "##v": 51,
      "##c": 52,
      "##h": 53,
      "##s": 54,
      "##g": 55,
      "##d": 56,
      "##b": 57,
      "##w": 58,
      "##an": 59,
      "##at": 60,
      "##si": 61,
      "##ng": 62,
      "bat": 63,
      "batu": 64,
      "##er": 65,
      "##ar": 66,
      "##asi": 67,
      "##bu": 68,
      "##asir": 69,
      "ber": 70,
      "abu": 71,
      "##ap": 72,
      "dan": 73,
      "##ing": 74,
      "##na": 75,
      "##arna": 76,
      "##pasir": 77,
      "batupasir": 78,
      "##ek": 79,
      "berw": 80,
      "berwarna": 81,
      "##mp": 82,
      "##ngan": 83,
      "##engan": 84,
      "batuan": 85,
      "##as": 86,
      "##it": 87,
      "##ang": 88,
      "##al": 89,
      "tu": 90,
      "##nd": 91,
      "##ung": 92,
      "##ik": 93,
      "tuf": 94,
      "##nde": 95,
      "br": 96,
      "##el": 97,
      "##sit": 98,
      "##ok": 99,
      "ande": 100,
      "andesit": 101,
      "dengan": 102,
      "##apan": 103,
      "##en": 104,
      "##ih": 105,
      "la": 106,
      "##va": 107,
      "lava": 108,
      "##ingk": 109,
      "singk": 110,
      "singkapan": 111,
      "##eksi": 112,
      "breksi": 113,
      "##au": 114,
      "##okl": 115,
      "ke": 116,
      "tuff": 117,
      "##uk": 118,
      "##is": 119,
      "##ur": 120,
      "##ij": 121,
      "##oklat": 122,
      "lap": 123,
      "##amp": 124,
      "##am": 125,
      "pasir": 126,
      "mengan": 127,
      "mengand": 128,
      "mengandung": 129,
      "##ul": 130,
      "##ak": 131,
      "##ut": 132,
      "##amping": 133,
      "se": 134,
      "##le": 135,
      "ku": 136,
      "ko": 137,
      "batug": 138,
      "##kan": 139,
      "batugamping": 140,
      "##sa": 141,
      "##ag": 142,
      "##ir": 143,
      "coklat": 144,
      "##or": 145,
      "vul": 146,
      "##kanik": 147,
      "vulkanik": 148,
      "##st": 149,
      "##itam": 150,
      "##mpung": 151,
      "kuar": 152,
      "##eku": 153,
      "ser": 154,
      "ter": 155,
      "hitam": 156,
      "lapuk": 157,
      "kuarsa": 158,
      "##us": 159,
      "##aan": 160,
      "##ud": 161,
      "mud": 162,
      "##auan": 163,
      "serp": 164,
      "gel": 165,
      "tufaan": 166,
      "keh": 167,
      "##men": 168,
      "serpih": 169,
      "gelap": 170,
      "##ah": 171,
      "##on": 172,
      "##il": 173,
      "beku": 174,
      "per": 175,
      "put": 176,
      "yang": 177,
      "putih": 178,
      "batule": 179,
      "batulempung": 180,
      "##ec": 181,
      "muda": 182,
      "kehij": 183,
      "##ingan": 184,
      "##mer": 185,
      "##ad": 186,
      "##ekst": 187,
      "##et": 188,
      "##ris": 189,
      "##ekstur": 190,
      "pad": 191,
      "kehijauan": 192,
      "##tal": 193,
      "padat": 194,
      "ret": 195,
      "retak": 196,
      "masi": 197,
      "##lo": 198,
      "masif": 199,
      "warna": 200,
      "##in": 201,
      "rij": 202,
      "bert": 203,
      "rijang": 204,
      "ker": 205,
      "##ias": 206,
      "##cias": 207,
      "brec": 208,
      "breccias": 209,
      "##sel": 210,
      "##selingan": 211,
      "hal": 212,
      "##nglo": 213,
      "konglo": 214,
      "##merat": 215,
      "konglomerat": 216,
      "halus": 217,
      "sed": 218,
      "komp": 219,
      "fr": 220,
      "##abu": 221,
      "##agmen": 222,
      "bertekstur": 223,
      "fragmen": 224,
      "##ol": 225,
      "keras": 226,
      "##itik": 227,
      "kec": 228,
      "##las": 229,
      "perselingan": 230,
      "##asal": 231,
      "##ristal": 232,
      "kel": 233,
      "batul": 234,
      "##agi": 235,
      "kompak": 236,
      "kelabu": 237,
      "klas": 238,
      "##tik": 239,
      "klastik": 240,
      "but": 241,
      "basal": 242,
      "kristal": 243,
      "butir": 244,
      "##oklatan": 245,
      "kecoklatan": 246,
      "terang": 247,
      "kar": 248,
      "##bon": 249,
      "##sil": 250,
      "pasiran": 251,
      "karbon": 252,
      "le": 253,
      "##fir": 254,
      "##agian": 255,
      "kas": 256,
      "kasar": 257,
      "sang": 258,
      "##anau": 259,
      "##isan": 260,
      "sangat": 261,
      "fo": 262,
      "hor": 263,
      "por": 264,
      "##nb": 265,
      "seb": 266,
      "##lende": 267,
      "fosil": 268,
      "hornb": 269,
      "hornblende": 270,
      "porfir": 271,
      "##uran": 272,
      "##es": 273,
      "##id": 274,
      "##ning": 275,
      "sebagian": 276,
      "sedang": 277,
      "porfiritik": 278,
      "##ya": 279,
      "##sif": 280,
      "##iner": 281,
      "##olus": 282,
      "di": 283,
      "##imen": 284,
      "##asit": 285,
      "sedimen": 286,
      "##ineral": 287,
      "pen": 288,
      "batulanau": 289,
      "len": 290,
      "molus": 291,
      "##okris": 292,
      "kuning": 293,
      "lempung": 294,
      "lensa": 295,
      "##li": 296,
      "##ari": 297,
      "dasit": 298,
      "sil": 299,
      "##un": 300,
      "##ka": 301,
      "penokris": 302,
      "at": 303,
      "in": 304,
      "##lap": 305,
      "##ahan": 306,
      "han": 307,
      "mar": 308,
      "mineral": 309,
      "##em": 310,
      "##erah": 311,
      "lapil": 312,
      "karbonat": 313,
      "hanc": 314,
      "lapilli": 315,
      "ka": 316,
      "##ru": 317,
      "##ika": 318,
      "terd": 319,
      "##olit": 320,
      "moluska": 321,
      "hancur": 322,
      "dari": 323,
      "keku": 324,
      "##if": 325,
      "beruk": 326,
      "lapisan": 327,
      "##esar": 328,
      "berukuran": 329,
      "besar": 330,
      "for": 331,
      "##ai": 332,
      "##amin": 333,
      "##isi": 334,
      "##gar": 335,
      "##apat": 336,
      "segar": 337,
      "dasite": 338,
      "terdapat": 339,
      "litik": 340,
      "mas": 341,
      "##par": 342,
      "##ungan": 343,
      "serpihan": 344,
      "int": 345,
      "massif": 346,
      "kr": 347,
      "tekstur": 348,
      "##end": 349,
      "##ca": 350,
      "##ekat": 351,
      "perlap": 352,
      "silika": 353,
      "perlapisan": 354,
      "lan": 355,
      "kaya": 356,
      "hij": 357,
      "merah": 358,
      "##ningan": 359,
      "##era": 360,
      "##ert": 361,
      "##onit": 362,
      "##ecahan": 363,
      "karbonatan": 364,
      "kekuningan": 365,
      "##ifera": 366,
      "foramin": 367,
      "lanauan": 368,
      "foraminifera": 369,
      "ban": 370,
      "bid": 371,
      "ole": 372,
      "pir": 373,
      "pecahan": 374,
      "##ump": 375,
      "##anah": 376,
      "batulump": 377,
      "bidang": 378,
      "oleh": 379,
      "batulumpur": 380,
      "end": 381,
      "fel": 382,
      "li": 383,
      "men": 384,
      "pekat": 385,
      "sek": 386,
      "##ab": 387,
      "##ro": 388,
      "##spar": 389,
      "##mpungan": 390,
      "##ston": 391,
      "##stru": 392,
      "mudston": 393,
      "lempungan": 394,
      "atau": 395,
      "marl": 396,
      "endapan": 397,
      "sekis": 398,
      "mudstone": 399,
      "ap": 400,
      "ba": 401,
      "tid": 402,
      "##eg": 403,
      "##iolit": 404,
      "##ral": 405,
      "##ukan": 406,
      "koral": 407,
      "terisi": 408,
      "bantal": 409,
      "baik": 410,
      "tidak": 411,
      "ad": 412,
      "cang": 413,
      "gun": 414,
      "pl": 415,
      "##kang": 416,
      "##ent": 417,
      "cangkang": 418,
      "gunung": 419,
      "am": 420,
      "lanau": 421,
      "nap": 422,
      "##pert": 423,
      "##kal": 424,
      "##erkal": 425,
      "berb": 426,
      "berselingan": 427,
      "##mpukan": 428,
      "tumpukan": 429,
      "sepert": 430,
      "##onen": 431,
      "komponen": 432,
      "kecil": 433,
      "hijau": 434,
      "napal": 435,
      "##erkalasi": 436,
      "seperti": 437,
      "gamping": 438,
      "##muk": 439,
      "##mul": 440,
      "##nya": 441,
      "##tit": 442,
      "bata": 443,
      "##alah": 444,
      "permuk": 445,
      "butiran": 446,
      "atas": 447,
      "interkalasi": 448,
      "krem": 449,
      "pirok": 450,
      "adalah": 451,
      "gampingan": 452,
      "permukaan": 453,
      "bagian": 454,
      "gr": 455,
      "kal": 456,
      "nu": 457,
      "pro": 458,
      "stal": 459,
      "tanah": 460,
      "##mit": 461,
      "##pil": 462,
      "##rit": 463,
      "##ga": 464,
      "##dspar": 465,
      "##anit": 466,
      "berpasir": 467,
      "lappil": 468,
      "terend": 469,
      "marmer": 470,
      "feldspar": 471,
      "liat": 472,
      "##mulit": 473,
      "granit": 474,
      "lappili": 475,
      "terendah": 476,
      "ek": 477,
      "gn": 478,
      "mul": 479,
      "ti": 480,
      "teg": 481,
      "##esi": 482,
      "##eis": 483,
      "##pan": 484,
      "##pis": 485,
      "##aj": 486,
      "##ta": 487,
      "##jaj": 488,
      "##sin": 489,
      "##aran": 490,
      "##alam": 491,
      "##alut": 492,
      "##elat": 493,
      "kemer": 494,
      "##itaman": 495,
      "serta": 496,
      "kehitaman": 497,
      "##rusi": 498,
      "intrusi": 499,
      "##strusif": 500,
      "api": 501,
      "piroksin": 502,
      "ekstrusif": 503,
      "gneis": 504,
      "mulai": 505,
      "tipis": 506,
      "tegas": 507,
      "kemerahan": 508,
      "an": 509,
      "cerah": 510,
      "pu": 511,
      "uk": 512,
      "vesi": 513,
      "##af": 514,
      "##ica": 515,
      "##tir": 516,
      "##kul": 517,
      "##butir": 518,
      "berbutir": 519,
      "##ingga": 520,
      "##ita": 521,
      "##ital": 522,
      "tua": 523,
      "##oklas": 524,
      "##agioklas": 525,
      "silica": 526,
      "##embu": 527,
      "krital": 528,
      "plagioklas": 529,
      "##entuk": 530,
      "ukuran": 531,
      "vesikul": 532,
      "dit": 533,
      "gl": 534,
      "hingga": 535,
      "me": 536,
      "##konit": 537,
      "##om": 538,
      "##olo": 539,
      "##ngk": 540,
      "berl": 541,
      "berlap": 542,
      "##aukonit": 543,
      "keabu": 544,
      "berbentuk": 545,
      "glaukonit": 546,
      "berlapis": 547,
      "camp": 548,
      "no": 549,
      "pap": 550,
      "pita": 551,
      "relat": 552,
      "sor": 553,
      "##mineral": 554,
      "##ay": 555,
      "##ind": 556,
      "##tr": 557,
      "##tasi": 558,
      "##otit": 559,
      "##juk": 560,
      "##dul": 561,
      "berg": 562,
      "bermineral": 563,
      "sejaj": 564,
      "##agai": 565,
      "##ori": 566,
      "kuarsit": 567,
      "ters": 568,
      "batulanah": 569,
      "sebagai": 570,
      "porfiris": 571,
      "##unjuk": 572,
      "instru": 573,
      "kaca": 574,
      "kekuning": 575,
      "menunjuk": 576,
      "campuran": 577,
      "nodul": 578,
      "paparan": 579,
      "relatif": 580,
      "sortasi": 581,
      "##indih": 582,
      "sejajar": 583,
      "instrusi": 584,
      "menunjukkan": 585,
      "be": 586,
      "bir": 587,
      "beg": 588,
      "ch": 589,
      "dolo": 590,
      "fan": 591,
      "fil": 592,
      "gab": 593,
      "ig": 594,
      "kan": 595,
      "let": 596,
      "mel": 597,
      "mil": 598,
      "mika": 599,
      "of": 600,
      "ob": 601,
      "py": 602,
      "po": 603,
      "rad": 604,
      "riolit": 605,
      "samp": 606,
      "sab": 607,
      "ul": 608,
      "##mb": 609,
      "##mmulit": 610,
      "##polit": 611,
      "##ni": 612,
      "##ib": 613,
      "##ian": 614,
      "##iol": 615,
      "##tur": 616,
      "##rna": 617,
      "##fat": 618,
      "##fib": 619,
      "##kar": 620,
      "##sfat": 621,
      "##dungan": 622,
      "##dian": 623,
      "##sipan": 624,
      "##sidian": 625,
      "berp": 626,
      "berarna": 627,
      "##api": 628,
      "##itu": 629,
      "##ange": 630,
      "##iklas": 631,
      "tufa": 632,
      "##enit": 633,
      "##ingkat": 634,
      "##uktur": 635,
      "##amaf": 636,
      "##aktit": 637,
      "##utit": 638,
      "##agmit": 639,
      "##agiklas": 640,
      "##orit": 641,
      "##usan": 642,
      "##usun": 643,
      "serpent": 644,
      "kehijau": 645,
      "##init": 646,
      "bertingkat": 647,
      "kerang": 648,
      "basalt": 649,
      "kristalin": 650,
      "##silutit": 651,
      "karbonan": 652,
      "diab": 653,
      "diorit": 654,
      "molusca": 655,
      "##aria": 656,
      "foram": 657,
      "##aminasi": 658,
      "##parit": 659,
      "hijauan": 660,
      "##erty": 661,
      "pirit": 662,
      "felspar": 663,
      "liparit": 664,
      "meny": 665,
      "apung": 666,
      "plagiklas": 667,
      "amonit": 668,
      "amfib": 669,
      "berbalut": 670,
      "kalkar": 671,
      "kalsilutit": 672,
      "numulit": 673,
      "nummulit": 674,
      "profir": 675,
      "propolit": 676,
      "stalaktit": 677,
      "stalagmit": 678,
      "pualam": 679,
      "##embung": 680,
      "vesikular": 681,
      "berlaminasi": 682,
      "keabuan": 683,
      "##tramaf": 684,
      "tersusun": 685,
      "bed": 686,
      "biru": 687,
      "begitu": 688,
      "cherty": 689,
      "dolomit": 690,
      "faner": 691,
      "filit": 692,
      "gabro": 693,
      "igni": 694,
      "kandungan": 695,
      "letusan": 696,
      "melange": 697,
      "milonit": 698,
      "ofiolit": 699,
      "obsidian": 700,
      "pyrit": 701,
      "posfat": 702,
      "radiol": 703,
      "sampai": 704,
      "sabak": 705,
      "ultramaf": 706,
      "##mbrit": 707,
      "serpentinit": 708,
      "diabes": 709,
      "amfibolit": 710,
      "kalkarenit": 711,
      "nummulites": 712,
      "ignimbrit": 713,
      "radiolaria": 714,
      "ultramafik": 715,
      "balut": 716,
      "get": 717,
      "mat": 718,
      "mon": 719,
      "mend": 720,
      "sisi": 721,
      "ziolit": 722,
      "##eit": 723,
      "##pih": 724,
      "##pasit": 725,
      "##lih": 726,
      "##tar": 727,
      "##rik": 728,
      "##ruktur": 729,
      "##kek": 730,
      "##kristal": 731,
      "##camp": 732,
      "##seit": 733,
      "##sisipan": 734,
      "batupasit": 735,
      "##erpih": 736,
      "##arkan": 737,
      "##arrna": 738,
      "berst": 739,
      "berasal": 740,
      "berapi": 741,
      "berkristal": 742,
      "bercamp": 743,
      "bersisipan": 744,
      "abuan": 745,
      "berwarrna": 746,
      "##asan": 747,
      "##elembung": 748,
      "breksia": 749,
      "keem": 750,
      "lapis": 751,
      "##ores": 752,
      "sering": 753,
      "terlih": 754,
      "terkek": 755,
      "##ilap": 756,
      "perid": 757,
      "##ekstr": 758,
      "bertekstr": 759,
      "konglomeratan": 760,
      "##ekati": 761,
      "menindih": 762,
      "permukaannya": 763,
      "gneiss": 764,
      "antar": 765,
      "anseit": 766,
      "mengk": 767,
      "##omik": 768,
      "bergelembung": 769,
      "menyerpih": 770,
      "profiritik": 771,
      "balutan": 772,
      "getas": 773,
      "matrik": 774,
      "monomik": 775,
      "mendekati": 776,
      "sisipan": 777,
      "berstruktur": 778,
      "bercampur": 779,
      "keemasan": 780,
      "##oresan": 781,
      "terlihat": 782,
      "terkekarkan": 783,
      "peridotit": 784,
      "antara": 785,
      "mengkilap": 786,
      "matriks": 787,
      "al": 788,
      "bo": 789,
      "bal": 790,
      "bil": 791,
      "bom": 792,
      "cl": 793,
      "cok": 794,
      "cokl": 795,
      "dalam": 796,
      "gas": 797,
      "gabu": 798,
      "gembu": 799,
      "hasi": 800,
      "kap": 801,
      "lu": 802,
      "mi": 803,
      "maf": 804,
      "pend": 805,
      "sc": 806,
      "##eng": 807,
      "##ic": 808,
      "berag": 809,
      "bersif": 810,
      "berisi": 811,
      "##nak": 812,
      "##mpun": 813,
      "##itih": 814,
      "##iri": 815,
      "##iran": 816,
      "pada": 817,
      "kering": 818,
      "kristalnya": 819,
      "##yai": 820,
      "##oluska": 821,
      "penjaj": 822,
      "terdiri": 823,
      "puitih": 824,
      "vesikula": 825,
      "diteng": 826,
      "mempun": 827,
      "##ngkah": 828,
      "##oria": 829,
      "berpori": 830,
      "faneritik": 831,
      "bertekstrur": 832,
      "aliran": 833,
      "bongkah": 834,
      "ball": 835,
      "bila": 836,
      "clay": 837,
      "cokelat": 838,
      "coklay": 839,
      "gabungan": 840,
      "gembur": 841,
      "hasil": 842,
      "kapur": 843,
      "lunak": 844,
      "mioluska": 845,
      "mafic": 846,
      "scoria": 847,
      "beragam": 848,
      "bersifat": 849,
      "berisikan": 850,
      "penjajaran": 851,
      "ditengah": 852,
      "mempunyai": 853,
      "bi": 854,
      "bar": 855,
      "cend": 856,
      "de": 857,
      "fen": 858,
      "goresan": 859,
      "ju": 860,
      "jel": 861,
      "mag": 862,
      "mor": 863,
      "oli": 864,
      "sal": 865,
      "ung": 866,
      "##ma": 867,
      "##po": 868,
      "##ub": 869,
      "##uan": 870,
      "##upasir": 871,
      "##uung": 872,
      "##yg": 873,
      "##yak": 874,
      "##tak": 875,
      "##folo": 876,
      "##oid": 877,
      "##vin": 878,
      "##sen": 879,
      "##gi": 880,
      "##dal": 881,
      "##bau": 882,
      "##erung": 883,
      "##aping": 884,
      "##ingin": 885,
      "##namp": 886,
      "kebau": 887,
      "kenamp": 888,
      "menganduung": 889,
      "##akkan": 890,
      "semen": 891,
      "##letak": 892,
      "batugaping": 893,
      "terletak": 894,
      "kehijuan": 895,
      "##emukan": 896,
      "banyak": 897,
      "ada": 898,
      "amyg": 899,
      "piroksen": 900,
      "ditindih": 901,
      "ditemukan": 902,
      "berlub": 903,
      "bergoresan": 904,
      "berpita": 905,
      "berbalutkan": 906,
      "fanerik": 907,
      "pendingin": 908,
      "biotit": 909,
      "barupasir": 910,
      "cenderung": 911,
      "depo": 912,
      "fenokris": 913,
      "juga": 914,
      "jelas": 915,
      "magma": 916,
      "morfolo": 917,
      "olivin": 918,
      "saling": 919,
      "ungu": 920,
      "##daloid": 921,
      "kenampakkan": 922,
      "amygdaloid": 923,
      "berlubang": 924,
      "pendinginan": 925,
      "deposit": 926,
      "morfologi": 927,
      "air": 928,
      "bt": 929,
      "besi": 930,
      "bentuk": 931,
      "did": 932,
      "gen": 933,
      "miner": 934,
      "ringan": 935,
      "sung": 936,
      "smul": 937,
      "str": 938,
      "tet": 939,
      "##emp": 940,
      "##min": 941,
      "##pat": 942,
      "##pecahan": 943,
      "##ug": 944,
      "##uaan": 945,
      "##terkalasi": 946,
      "##temp": 947,
      "##hingga": 948,
      "##srna": 949,
      "##atnya": 950,
      "##sir": 951,
      "batap": 952,
      "batuap": 953,
      "berin": 954,
      "beratnya": 955,
      "##apung": 956,
      "berwsrna": 957,
      "##ikil": 958,
      "lain": 959,
      "lamin": 960,
      "##iss": 961,
      "mengandungpecahan": 962,
      "setemp": 963,
      "sehingga": 964,
      "kuat": 965,
      "terli": 966,
      "terapung": 967,
      "##udut": 968,
      "gelembung": 969,
      "persel": 970,
      "##inngan": 971,
      "kerikil": 972,
      "halur": 973,
      "pori": 974,
      "hancuran": 975,
      "##esarkan": 976,
      "lanuaan": 977,
      "##alamnya": 978,
      "tersesarkan": 979,
      "menyudut": 980,
      "berbalutan": 981,
      "profiris": 982,
      "bertekstrus": 983,
      "pendingan": 984,
      "ditengahnya": 985,
      "btug": 986,
      "besisipan": 987,
      "didalamnya": 988,
      "geniss": 989,
      "minera": 990,
      "sungai": 991,
      "smulai": 992,
      "struktur": 993,
      "tetapi": 994,
      "batapasir": 995,
      "batuapsir": 996,
      "berinterkalasi": 997,
      "lainnya": 998,
      "laminasi": 999,
      "setempat": 1000,
      "terlipat": 1001,
      "perselinngan": 1002,
      "btugamping": 1003
    }
  }
}