{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFD"
      },
      {
        "type": "Lowercase"
      },
      {
        "type": "StripAccents"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "BertPreTokenizer"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          2
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          3
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": {
    "type": "WordPiece",
    "prefix": "##",
    "cleanup": true
  },
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[UNK]": 0,
      "[PAD]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      "(": 5,
      ")": 6,
      ",": 7,
      "-": 8,
      ".": 9,
      "a": 10,
      "b": 11,
      "c": 12,
      "d": 13,
      "e": 14,
      "f": 15,
      "g": 16,
      "h": 17,
      "i": 18,
      "j": 19,
      "k": 20,
      "l": 21,
      "m": 22,
      "n": 23,
      "o": 24,
      "p": 25,
      "r": 26,
      "s": 27,
      "t": 28,
      "u": 29,
      "v": 30,
      "w": 31,
      "y": 32,
      "z": 33,
      "##e": 34,
      "##t": 35,
      "##a": 36,
      "##s": 37,
      "##k": 38,
      "##u": 39,
      "##r": 40,
      "##i": 41,
      "##l": 42,
      "##g": 43,
      "##m": 44,
      "##n": 45,
      "##y": 46,
      "##d": 47,
      "##o": 48,
      "##c": 49,
      "##h": 50,
      "##p": 51,
      "##w": 52,
      "##f": 53,
      "##b": 54,
      "##j": 55,
      "##v": 56,
      "##an": 57,
      "##ng": 58,
      "##at": 59,
      "##er": 60,
      "bat": 61,
      "batu": 62,
      "##si": 63,
      "##ar": 64,
      "##ing": 65,
      "ber": 66,
      "##am": 67,
      "batuan": 68,
      "##bu": 69,
      "##ap": 70,
      "##it": 71,
      "##ang": 72,
      "##ngan": 73,
      "##al": 74,
      "##en": 75,
      "abu": 76,
      "##engan": 77,
      "##na": 78,
      "##arna": 79,
      "##de": 80,
      "##asi": 81,
      "##st": 82,
      "##warna": 83,
      "berwarna": 84,
      "##el": 85,
      "dan": 86,
      "##sit": 87,
      "an": 88,
      "##amp": 89,
      "##desit": 90,
      "andesit": 91,
      "##ur": 92,
      "##asir": 93,
      "##amping": 94,
      "##ik": 95,
      "##ek": 96,
      "##gamping": 97,
      "batugamping": 98,
      "##apan": 99,
      "sing": 100,
      "##kapan": 101,
      "singkapan": 102,
      "dengan": 103,
      "##or": 104,
      "##is": 105,
      "##ung": 106,
      "##ak": 107,
      "##pasir": 108,
      "batupasir": 109,
      "##ih": 110,
      "##ir": 111,
      "##ok": 112,
      "##la": 113,
      "##ij": 114,
      "##mp": 115,
      "ter": 116,
      "##itam": 117,
      "##on": 118,
      "yang": 119,
      "##et": 120,
      "ko": 121,
      "ser": 122,
      "mengan": 123,
      "se": 124,
      "##uk": 125,
      "##dung": 126,
      "mengandung": 127,
      "hitam": 128,
      "serp": 129,
      "ret": 130,
      "##mer": 131,
      "##ekst": 132,
      "retak": 133,
      "per": 134,
      "##ekstur": 135,
      "ke": 136,
      "rij": 137,
      "##ag": 138,
      "rijang": 139,
      "##ut": 140,
      "serpih": 141,
      "##au": 142,
      "##ah": 143,
      "##in": 144,
      "##lo": 145,
      "##abu": 146,
      "##men": 147,
      "##as": 148,
      "bert": 149,
      "bertekstur": 150,
      "##ingan": 151,
      "##nglo": 152,
      "konglo": 153,
      "##merat": 154,
      "konglomerat": 155,
      "##sel": 156,
      "##us": 157,
      "##selingan": 158,
      "kel": 159,
      "kelabu": 160,
      "kla": 161,
      "##apis": 162,
      "##stik": 163,
      "klastik": 164,
      "##lat": 165,
      "##oklat": 166,
      "##il": 167,
      "kr": 168,
      "terang": 169,
      "perselingan": 170,
      "la": 171,
      "##sa": 172,
      "##fir": 173,
      "##va": 174,
      "lava": 175,
      "hal": 176,
      "kar": 177,
      "##di": 178,
      "##bon": 179,
      "##apisan": 180,
      "halus": 181,
      "karbon": 182,
      "hor": 183,
      "por": 184,
      "##ist": 185,
      "##len": 186,
      "##nb": 187,
      "hornb": 188,
      "##istal": 189,
      "##lende": 190,
      "hornblende": 191,
      "##emp": 192,
      "porfir": 193,
      "pasir": 194,
      "##itik": 195,
      "##eku": 196,
      "##auan": 197,
      "coklat": 198,
      "##id": 199,
      "kristal": 200,
      "beku": 201,
      "lemp": 202,
      "pen": 203,
      "##ian": 204,
      "##bag": 205,
      "sebag": 206,
      "porfiritik": 207,
      "sebagian": 208,
      "##uran": 209,
      "sedi": 210,
      "sedimen": 211,
      "but": 212,
      "##sil": 213,
      "butir": 214,
      "len": 215,
      "masi": 216,
      "##ris": 217,
      "##okris": 218,
      "keh": 219,
      "##iner": 220,
      "lensa": 221,
      "masif": 222,
      "fr": 223,
      "gel": 224,
      "##ump": 225,
      "batul": 226,
      "##agmen": 227,
      "##ineral": 228,
      "fragmen": 229,
      "sil": 230,
      "penokris": 231,
      "gelap": 232,
      "##un": 233,
      "komp": 234,
      "fo": 235,
      "han": 236,
      "put": 237,
      "##erah": 238,
      "##ari": 239,
      "##ahan": 240,
      "karbonat": 241,
      "pasiran": 242,
      "fosil": 243,
      "hanc": 244,
      "putih": 245,
      "lap": 246,
      "mu": 247,
      "##lit": 248,
      "##ika": 249,
      "hancur": 250,
      "lapuk": 251,
      "lan": 252,
      "warna": 253,
      "##es": 254,
      "##if": 255,
      "for": 256,
      "ku": 257,
      "lapisan": 258,
      "mineral": 259,
      "foram": 260,
      "kuar": 261,
      "kas": 262,
      "##isi": 263,
      "kec": 264,
      "kasar": 265,
      "dari": 266,
      "##tal": 267,
      "##ungan": 268,
      "##par": 269,
      "beruk": 270,
      "##ijauan": 271,
      "serpihan": 272,
      "lempung": 273,
      "berukuran": 274,
      "##lapisan": 275,
      "perlapisan": 276,
      "silika": 277,
      "ol": 278,
      "##kan": 279,
      "##ca": 280,
      "merah": 281,
      "##ec": 282,
      "##era": 283,
      "##onit": 284,
      "##inif": 285,
      "karbonatan": 286,
      "lanauan": 287,
      "foraminif": 288,
      "##ecahan": 289,
      "foraminifera": 290,
      "bid": 291,
      "pir": 292,
      "pecahan": 293,
      "##eh": 294,
      "##umpur": 295,
      "batulumpur": 296,
      "kuarsa": 297,
      "oleh": 298,
      "bidang": 299,
      "di": 300,
      "fel": 301,
      "sek": 302,
      "tekstur": 303,
      "##ab": 304,
      "##spar": 305,
      "##dap": 306,
      "##dst": 307,
      "terdap": 308,
      "##one": 309,
      "lempungan": 310,
      "kehijauan": 311,
      "mudst": 312,
      "sekis": 313,
      "terdapat": 314,
      "mudstone": 315,
      "ap": 316,
      "##eg": 317,
      "##em": 318,
      "##olit": 319,
      "terisi": 320,
      "##ukan": 321,
      "##oklatan": 322,
      "kompak": 323,
      "kecoklatan": 324,
      "ad": 325,
      "gun": 326,
      "men": 327,
      "pla": 328,
      "tid": 329,
      "##fi": 330,
      "##las": 331,
      "gunung": 332,
      "plag": 333,
      "tidak": 334,
      "am": 335,
      "ban": 336,
      "nap": 337,
      "tump": 338,
      "##anau": 339,
      "##onen": 340,
      "batulanau": 341,
      "komponen": 342,
      "napal": 343,
      "tumpukan": 344,
      "gamping": 345,
      "##tit": 346,
      "##ul": 347,
      "##mu": 348,
      "##alah": 349,
      "pirok": 350,
      "adalah": 351,
      "gampingan": 352,
      "at": 353,
      "gr": 354,
      "kal": 355,
      "kor": 356,
      "mar": 357,
      "nu": 358,
      "stal": 359,
      "##ro": 360,
      "##ip": 361,
      "##ga": 362,
      "##mit": 363,
      "##ya": 364,
      "##dspar": 365,
      "##ol": 366,
      "##anit": 367,
      "##lai": 368,
      "feldspar": 369,
      "bantal": 370,
      "##mulit": 371,
      "granit": 372,
      "koral": 373,
      "marmer": 374,
      "gn": 375,
      "ker": 376,
      "sang": 377,
      "teg": 378,
      "tip": 379,
      "##esi": 380,
      "##eis": 381,
      "##ua": 382,
      "##pan": 383,
      "##sin": 384,
      "##alam": 385,
      "##alut": 386,
      "##ent": 387,
      "##elat": 388,
      "##itaman": 389,
      "##asal": 390,
      "kehitaman": 391,
      "mulai": 392,
      "##esar": 393,
      "api": 394,
      "piroksin": 395,
      "gneis": 396,
      "sangat": 397,
      "tegas": 398,
      "tipis": 399,
      "ba": 400,
      "besar": 401,
      "cerah": 402,
      "tua": 403,
      "vesi": 404,
      "##iok": 405,
      "##ica": 406,
      "##gar": 407,
      "##fat": 408,
      "##ingga": 409,
      "berb": 410,
      "##ita": 411,
      "##ital": 412,
      "##ijau": 413,
      "segar": 414,
      "##merahan": 415,
      "kemerahan": 416,
      "krital": 417,
      "silica": 418,
      "plagiok": 419,
      "baik": 420,
      "vesik": 421,
      "plagioklas": 422,
      "dit": 423,
      "gla": 424,
      "hingga": 425,
      "##eng": 426,
      "##nya": 427,
      "##olo": 428,
      "bersi": 429,
      "berselingan": 430,
      "##ukonit": 431,
      "keabu": 432,
      "kecil": 433,
      "glaukonit": 434,
      "camp": 435,
      "no": 436,
      "pita": 437,
      "relat": 438,
      "##lapis": 439,
      "##mineral": 440,
      "##dul": 441,
      "##otit": 442,
      "##juk": 443,
      "##ert": 444,
      "berg": 445,
      "berlapis": 446,
      "bermineral": 447,
      "porfiris": 448,
      "##unjuk": 449,
      "kuarsit": 450,
      "menunjuk": 451,
      "campuran": 452,
      "nodul": 453,
      "relatif": 454,
      "menunjukkan": 455,
      "be": 456,
      "br": 457,
      "bir": 458,
      "beg": 459,
      "basal": 460,
      "ch": 461,
      "dasi": 462,
      "dolo": 463,
      "fil": 464,
      "gab": 465,
      "hijauan": 466,
      "ig": 467,
      "ka": 468,
      "kan": 469,
      "li": 470,
      "let": 471,
      "mel": 472,
      "mil": 473,
      "mika": 474,
      "mol": 475,
      "ob": 476,
      "ofi": 477,
      "pu": 478,
      "po": 479,
      "pro": 480,
      "ra": 481,
      "sab": 482,
      "uk": 483,
      "ul": 484,
      "##tr": 485,
      "##af": 486,
      "##sfat": 487,
      "##kar": 488,
      "##rit": 489,
      "##im": 490,
      "##mmulit": 491,
      "##nim": 492,
      "##dungan": 493,
      "##bolit": 494,
      "##brit": 495,
      "##sidi": 496,
      "##sipan": 497,
      "berp": 498,
      "##amaf": 499,
      "##bung": 500,
      "##itu": 501,
      "##ange": 502,
      "##enit": 503,
      "##iklas": 504,
      "##eksi": 505,
      "##orit": 506,
      "##aktit": 507,
      "serpent": 508,
      "##agmit": 509,
      "##utit": 510,
      "##init": 511,
      "##usan": 512,
      "##usca": 513,
      "##diol": 514,
      "karbonan": 515,
      "kristalin": 516,
      "##silutit": 517,
      "kehijau": 518,
      "##aria": 519,
      "lanau": 520,
      "##parit": 521,
      "pirit": 522,
      "diab": 523,
      "diorit": 524,
      "felspar": 525,
      "apung": 526,
      "##embung": 527,
      "meny": 528,
      "##fibolit": 529,
      "plagiklas": 530,
      "amonit": 531,
      "amfibolit": 532,
      "##ular": 533,
      "atau": 534,
      "atas": 535,
      "kalkar": 536,
      "kalsilutit": 537,
      "numulit": 538,
      "nummulit": 539,
      "stalaktit": 540,
      "stalagmit": 541,
      "kerang": 542,
      "##alutan": 543,
      "vesikular": 544,
      "keabuan": 545,
      "##erty": 546,
      "bed": 547,
      "breksi": 548,
      "biru": 549,
      "begitu": 550,
      "basalt": 551,
      "cherty": 552,
      "dasit": 553,
      "dolomit": 554,
      "filit": 555,
      "gabro": 556,
      "ignim": 557,
      "kaca": 558,
      "kandungan": 559,
      "liparit": 560,
      "letusan": 561,
      "melange": 562,
      "milonit": 563,
      "molusca": 564,
      "obsidi": 565,
      "ofiolit": 566,
      "pualam": 567,
      "posfat": 568,
      "profir": 569,
      "radiol": 570,
      "sabak": 571,
      "ukuran": 572,
      "ultr": 573,
      "##amafik": 574,
      "serpentinit": 575,
      "diabes": 576,
      "kalkarenit": 577,
      "nummulites": 578,
      "ignimbrit": 579,
      "obsidian": 580,
      "radiolaria": 581,
      "ultramafik": 582,
      "balutan": 583,
      "get": 584,
      "lapis": 585,
      "mat": 586,
      "meng": 587,
      "sisi": 588,
      "zi": 589,
      "##tar": 590,
      "##kr": 591,
      "##kek": 592,
      "##kil": 593,
      "##rik": 594,
      "##dih": 595,
      "##camp": 596,
      "##pih": 597,
      "##erpih": 598,
      "bata": 599,
      "##arkan": 600,
      "berap": 601,
      "berasal": 602,
      "berkr": 603,
      "bercamp": 604,
      "abuan": 605,
      "##elembung": 606,
      "antar": 607,
      "##ores": 608,
      "terl": 609,
      "terkek": 610,
      "sering": 611,
      "perid": 612,
      "keem": 613,
      "##indih": 614,
      "##asan": 615,
      "konglomeratan": 616,
      "##entuk": 617,
      "gneiss": 618,
      "berbalut": 619,
      "bersisipan": 620,
      "bergelembung": 621,
      "menyerpih": 622,
      "profiritik": 623,
      "getas": 624,
      "matrik": 625,
      "mengkil": 626,
      "sisipan": 627,
      "ziolit": 628,
      "berapi": 629,
      "berkristal": 630,
      "bercampur": 631,
      "antara": 632,
      "##oresan": 633,
      "terkekarkan": 634,
      "peridotit": 635,
      "keemasan": 636,
      "matriks": 637,
      "mengkilap": 638,
      "al": 639,
      "bo": 640,
      "bal": 641,
      "cok": 642,
      "cla": 643,
      "dalam": 644,
      "gabu": 645,
      "gas": 646,
      "hasi": 647,
      "hijau": 648,
      "kap": 649,
      "kun": 650,
      "ma": 651,
      "memp": 652,
      "pa": 653,
      "##aj": 654,
      "##aan": 655,
      "##kah": 656,
      "##ula": 657,
      "##muk": 658,
      "##da": 659,
      "##jaj": 660,
      "##ngkah": 661,
      "##aran": 662,
      "berag": 663,
      "berisi": 664,
      "##ori": 665,
      "##ihat": 666,
      "##iran": 667,
      "permuk": 668,
      "krem": 669,
      "kristalnya": 670,
      "pend": 671,
      "penjaj": 672,
      "##unya": 673,
      "##fic": 674,
      "keras": 675,
      "berbentuk": 676,
      "vesikula": 677,
      "diteng": 678,
      "bersifat": 679,
      "berpori": 680,
      "terlihat": 681,
      "aliran": 682,
      "bongkah": 683,
      "ball": 684,
      "cokelat": 685,
      "clay": 686,
      "gabungan": 687,
      "hasil": 688,
      "kapur": 689,
      "kuning": 690,
      "mafic": 691,
      "mempunya": 692,
      "pada": 693,
      "beragam": 694,
      "berisikan": 695,
      "permukaan": 696,
      "penjajaran": 697,
      "ditengah": 698,
      "mempunyai": 699,
      "bi": 700,
      "cen": 701,
      "fan": 702,
      "fen": 703,
      "goresan": 704,
      "ju": 705,
      "jel": 706,
      "ken": 707,
      "keku": 708,
      "lu": 709,
      "mor": 710,
      "mag": 711,
      "sal": 712,
      "ung": 713,
      "##ta": 714,
      "##tir": 715,
      "##sen": 716,
      "##iv": 717,
      "##gi": 718,
      "##gd": 719,
      "##ma": 720,
      "##ningan": 721,
      "##yak": 722,
      "##ygd": 723,
      "##der": 724,
      "##dang": 725,
      "##oid": 726,
      "##folo": 727,
      "##bau": 728,
      "##erik": 729,
      "##ingin": 730,
      "berbu": 731,
      "##aloid": 732,
      "##nak": 733,
      "##ampak": 734,
      "ters": 735,
      "serta": 736,
      "semen": 737,
      "sedang": 738,
      "kebau": 739,
      "oliv": 740,
      "##emukan": 741,
      "ada": 742,
      "menindih": 743,
      "amygd": 744,
      "banyak": 745,
      "piroksen": 746,
      "ditindih": 747,
      "ditemukan": 748,
      "bergoresan": 749,
      "berpita": 750,
      "berbalutkan": 751,
      "pendingin": 752,
      "biotit": 753,
      "cender": 754,
      "fanerik": 755,
      "fenokris": 756,
      "juga": 757,
      "jelas": 758,
      "kenampak": 759,
      "kekuningan": 760,
      "lunak": 761,
      "morfolo": 762,
      "magma": 763,
      "saling": 764,
      "ungu": 765,
      "berbutir": 766,
      "olivin": 767,
      "amygdaloid": 768,
      "pendinginan": 769,
      "cenderung": 770,
      "kenampakkan": 771,
      "morfologi": 772,
      "air": 773,
      "bt": 774,
      "besi": 775,
      "bentuk": 776,
      "did": 777,
      "en": 778,
      "gen": 779,
      "miner": 780,
      "ringan": 781,
      "sung": 782,
      "set": 783,
      "smu": 784,
      "##ai": 785,
      "##ud": 786,
      "##ugamping": 787,
      "##rus": 788,
      "##dapan": 789,
      "##hingga": 790,
      "##pecahan": 791,
      "##pert": 792,
      "##atnya": 793,
      "beratnya": 794,
      "##apung": 795,
      "##ikil": 796,
      "##iss": 797,
      "terapung": 798,
      "sehingga": 799,
      "sepert": 800,
      "mengandungpecahan": 801,
      "##ekstrus": 802,
      "persel": 803,
      "##inngan": 804,
      "##innya": 805,
      "bertekstrus": 806,
      "##usun": 807,
      "lainnya": 808,
      "halur": 809,
      "pori": 810,
      "##empat": 811,
      "butiran": 812,
      "gelembung": 813,
      "hancuran": 814,
      "lanua": 815,
      "##ipat": 816,
      "kerikil": 817,
      "##alamnya": 818,
      "##esarkan": 819,
      "berbalutan": 820,
      "menyud": 821,
      "profiris": 822,
      "terlipat": 823,
      "pendingan": 824,
      "ditengahnya": 825,
      "tersusun": 826,
      "tersesarkan": 827,
      "btugamping": 828,
      "besisipan": 829,
      "didalamnya": 830,
      "endapan": 831,
      "geniss": 832,
      "minera": 833,
      "sungai": 834,
      "setempat": 835,
      "smulai": 836,
      "seperti": 837,
      "perselinngan": 838,
      "lanuaan": 839,
      "menyudut": 840
    }
  }
}